Repository: zhrispineda/Settings-iOS
Catalog: Preferences/Resources/Localizations/Ungrouped/SOS.xcstrings
Source language: en
Languages: ar, bg, ca, cs, da, de, el, es, es_us, fi, fr, fr_ca, he, hi, hr, hu, id, it, ja, kk, ko, lt, ms, nl, no, pl, pt_br, pt_pt, ro, ru, sk, sl, sv, th, tr, uk, vi, zh_cn, zh_hk, zh_tw

# ACCIDENTAL_SOS_FEEDBACK_ASSISTANT_LEGAL_TEXT
source: This tool generates files that allow Apple to investigate issues with your iPhone and help improve Apple products. The files might contain personal information found on your device or associated with your iCloud accounts, including but not limited to your name, serial numbers of your device, your device name, your email address and email settings, Siri suggestions, and network connection information. This information is used by Apple in accordance with its privacy policy (www.apple.com/privacy) and is not shared with any other company. By using this tool and sending the results to Apple, you consent to Apple using the contents of these files to improve Apple products.
ar: تنشئ هذه الأداة الملفات التي تسمح لـ Apple بالتحقيق في المشاكل التي تواجهها في iPhone والمساعدة في تحسين منتجات Apple. قد تحتوي الملفات على معلومات شخصية موجودة على جهازك أو مقترنة بحسابات iCloud، بما في ذلك - على سبيل المثال لا الحصر - اسمك والأرقام التسلسلية لجهازك واسم جهازك واسم المستخدم وعنوان بريدك الإلكتروني وإعدادات البريد الإلكتروني واقتراحات Siri ومعلومات اتصال الشبكة. يتم استخدام هذه المعلومات من جانب Apple وفقًا لسياسة الخصوصية المتبعة لديها (www.apple.com/ae-ar/privacy)، ولا تتم مشاركتها مع أي شركة أخرى. يُعد استخدام هذه الأداة وإرسال النتائج إلى Apple بمثابة موافقة منك لشركة Apple لاستخدام محتويات هذه الملفات بغرض تحسين منتجات Apple.
bg: Този инструмент генерира файлове, които позволяват на Apple да изследва проблеми с вашия iPhone и помага за подобрението на продукти на Apple. Файловете могат да съдържат лична информация, открита на вашето устройство или свързана с регистрациите ви в iCloud, включително, но не само, вашето име, серийни номера на устройството, име на устройството, имейл адрес и настройки на имейла, предложения от Siri и информация за връзката с мрежата. Tази информация се използва от Apple в съответствие с политиката за поверителност (www.apple.com/privacy) и не се споделя с други компании. С използването на този инструмент и изпращането на резултатите до Apple вие давате съгласието си на Apple да използва съдържанието на тези файлове, за да подобри продуктите на Apple.
ca: Aquesta eina genera arxius que permeten que Apple investigui els problemes de l’iPhone per ajudar a millorar els productes d’Apple. Els arxius poden contenir dades personals que es troben al dispositiu o que estan associades als teus comptes de l’iCloud, com ara el teu nom, el nom i els números de sèrie del dispositiu, la teva adreça electrònica i la configuració del correu, els suggeriments de Siri i informació sobre la connexió de xarxa, entre d’altres. Apple utilitza aquesta informació d’acord amb la seva política de privacitat (www.apple.com/es/privacy) i no la comparteix amb cap altra empresa. En utilitzar aquesta eina i enviar els resultats a Apple, dones permís a Apple per fer servir el contingut d’aquests arxius per millorar els productes d’Apple.
cs: Tento nástroj vytváří soubory, které umožňují společnosti Apple prozkoumat problémy s vaším iPhonem a pomáhají jí s vylepšováním jejích produktů. Soubory mohou obsahovat osobní údaje nalezené ve vašem zařízení či sdružené s vaším účtem na iCloudu, mimo jiné vaše jméno, sériová čísla zařízení, název zařízení, vaši e‑mailovou adresu a nastavení pošty, návrhy Siri a informace o připojení k síti. Tyto údaje jsou společností Apple využívány v souladu s jejími zásadami ochrany osobních údajů (www.apple.com/cz/privacy) a nejsou sdíleny s žádnou další společností. Použitím tohoto nástroje a odesláním výsledků společnosti Apple vyjadřujete svůj souhlas s tím, že společnost Apple využije obsah souborů k vylepšování svých produktů.
da: Dette værktøj fremstiller arkiver, der tillader Apple at undersøge problemer med din iPhone, og hjælper med at forbedre Apples produkter. Arkiverne kan indeholde personlige oplysninger fundet på din enhed eller forbundet med dine iCloud-konti, herunder, men ikke begrænset til, dit navn, din enheds serienummer, din enheds navn, din e-mailadresse og dine e-mailindstillinger, dine Siri-forslag og oplysninger om netværksforbindelse. Disse oplysninger bruges af Apple i overensstemmelse med Apples anonymitetspolitik (www.apple.com/dk/privacy) og deles ikke med andre virksomheder. Når du bruger dette værktøj og sender resultaterne til Apple, indvilliger du i, at Apple bruger indholdet i disse arkiver til at forbedre Apples produkter.
de: Dieses Programm erzeugt Dateien, die es Apple ermöglichen, Probleme mit deinem iPhone zu diagnostizieren und Apple-Produkte zu optimieren. Die Dateien enthalten möglicherweise persönliche Daten, die auf deinem Gerät zu finden oder mit deinen iCloud-Accounts verknüpft sind. Dazu gehören beispielsweise dein Name, die Seriennummern deines Geräts, der Gerätename, deine E-Mail-Adresse und E-Mail-Einstellungen, Siri-Vorschläge sowie Informationen zur Netzwerkverbindung. Diese Daten werden von Apple gemäß seiner Datenschutzrichtlinien (www.apple.com/de/privacy) genutzt und nicht an andere Unternehmen weitergegeben. Wenn du dieses Programm verwendest und die Ergebnisse an Apple sendest, erklärst du dich damit einverstanden, dass Apple den Inhalt dieser Dateien verwendet, um Apple-Produkte zu optimieren.
el: Το εργαλείο αυτό δημιουργεί αρχεία που επιτρέπουν στην Apple να ερευνά προβλήματα με το iPhone σας και βοηθούν στη βελτίωση των προϊόντων Apple. Τα αρχεία μπορεί να περιέχουν προσωπικές πληροφορίες που υπάρχουν στη συσκευή σας ή σχετίζονται με τους λογαριασμούς σας iCloud, στις οποίες περιλαμβάνονται, μεταξύ άλλων, το όνομά σας, σειριακοί αριθμοί της συσκευής σας, το όνομα της συσκευής σας, η διεύθυνση email και οι ρυθμίσεις email σας, οι προτάσεις Siri και πληροφορίες σύνδεσης δικτύου. Οι πληροφορίες αυτές χρησιμοποιούνται από την Apple σύμφωνα με την πολιτική απορρήτου της (www.apple.com/gr/privacy) και δεν κοινοποιούνται σε οποιαδήποτε άλλη εταιρεία. Χρησιμοποιώντας αυτό το εργαλείο και στέλνοντας τα αποτελέσματα στην Apple, επιτρέπετε στην Apple να χρησιμοποιήσει τα περιεχόμενα αυτών των αρχείων για τη βελτίωση των προϊόντων Apple.
es: Esta herramienta genera archivos que permiten a Apple investigar problemas relacionados con tu iPhone y ayudar a mejorar sus productos. Estos archivos pueden contener información personal que se haya encontrado en tu dispositivo o que esté asociada a tus cuentas de iCloud (lo que incluye, por ejemplo, tu nombre, los números de serie y el nombre de tu dispositivo, tu dirección de correo electrónico y los ajustes de tu cuenta de correo, las sugerencias de Siri e información sobre la conexión de red). Apple hace uso de esta información de acuerdo con lo establecido en su política de privacidad (www.apple.com/es/privacy) y no la comparte con ninguna otra empresa. Al usar esta herramienta y enviar los resultados a Apple, aceptas que Apple utilice el contenido de dichos archivos para mejorar sus productos.
es_us: Esta herramienta genera archivos que permiten a Apple investigar los problemas de tu iPhone y mejorar sus productos. Los archivos pueden contener información personal encontrada en tu dispositivo o asociada con tus cuentas de iCloud que incluye, pero no se limita, a tu nombre, los números de serie y el nombre del dispositivo, la dirección y configuración de tu correo electrónico, las sugerencias de Siri y la información de conexión a redes. Apple utiliza esta información de acuerdo con su política de privacidad (www.apple.com/la/privacy) y no la comparte con otras empresas. Al usar esta herramienta y enviar los resultados a Apple, aceptas que Apple use el contenido de estos archivos para mejorar sus productos.
fi: Tämä työkalu luo tiedostoja, joiden avulla Apple voi tutkia iPhonesi ongelmia. Ne auttavat myös parantamaan Applen tuotteita. Tiedostot saattavat sisältää laitteella olevia tai iCloud-tileihin liittyviä henkilökohtaisia tietoja, kuten nimesi, laitteen sarjanumero, laitteen nimi, sähköpostiosoitteesi ja -asetuksesi, Siri-ehdotuksia ja verkkomääritystietoja. Apple käyttää näitä tietoja tietosuojakäytäntönsä (www.apple.com/fi/privacy) mukaisesti eikä jaa niitä muille yrityksille. Käyttämällä tätä työkalua ja lähettämällä tulokset Applelle, hyväksyt, että Apple käyttää tiedostojen sisältöä Applen tuotteiden parantamiseen.
fr: Cet outil génère des fichiers permettant à Apple d’enquêter sur les problèmes de votre iPhone et d’améliorer les produits Apple. Les fichiers peuvent contenir des données personnelles stockées sur votre appareil ou associées à vos comptes iCloud, telles que, mais sans s’y limiter, votre nom, les numéros de série de votre appareil, le nom de votre appareil, votre adresse e-mail et vos réglages de messagerie, les suggestions de Siri et des informations de connexion réseau. Ces informations sont utilisées par Apple conformément à son engagement de confidentialité (www.apple.com/fr/privacy) et ne sont partagées avec aucune autre entreprise. En utilisant cet outil et en envoyant les résultats à Apple, vous consentez à ce qu’Apple utilise le contenu de ces fichiers pour améliorer ses produits.
fr_ca: Cet outil génère des fichiers permettant à Apple d’enquêter sur les problèmes de votre iPhone et d’améliorer les produits Apple. Les fichiers peuvent contenir des informations personnelles stockées sur votre appareil ou associées à vos comptes iCloud, telles que, mais sans s’y limiter, votre nom, les numéros de série de votre appareil, le nom de votre appareil, votre adresse courriel et vos réglages de messagerie, les suggestions de Siri et des informations de connexion réseau. Ces informations sont utilisées par Apple conformément à sa politique de confidentialité (www.apple.com/ca/fr/privacy) et ne sont partagées avec aucune autre entreprise. En utilisant cet outil de diagnostic et en envoyant les résultats à Apple, vous consentez à ce qu’Apple utilise le contenu de ces fichiers pour améliorer ses produits.
he: כלי זה יוצר קבצים המאפשרים ל-Apple לבדוק בעיות ב-iPhone שלך ומסייעים לשפר את מוצרי Apple. הקבצים עשויים לכלול פרטים אישיים שנמצאים במכשיר שלך או פרטים אישיים המשויכים לחשבונות ה-iCloud שלך, לרבות, בין השאר, שמך, המספרים הסידוריים של המכשיר שלך, שם המכשיר, כתובת הדוא״ל והגדרות הדוא״ל שלך, הצעות של Siri ופרטי חיבור לרשת. ‏Apple משתמשת במידע זה בהתאם למדיניות הפרטיות שלה (www.apple.com/privacy) ואינה משתפת בו חברות אחרות. שימוש בכלי זה ושליחת התוצאות ל-Apple מהווים את הסכמתך לכך ש-Apple תשתמש בתוכן הכלול בקבצים אלה כדי לשפר את מוצריה.
hi: यह टूल ऐसी फ़ाइलें तैयार करता है जो Apple को आपके iPhone से जुड़ी समस्याओं की जाँच करने और Apple उत्पादों को बेहतर बनाने में सहायता करने की अनुमति देती हैं। फ़ाइलों में आपका नाम, आपके डिवाइस के सीरियल नंबर, आपके डिवाइस का नाम, आपका ईमेल पता और ईमेल सेटिंग्ज़, Siri सुझाव और नेटवर्क कनेक्शन जानकारी समेत आपके डिवाइस पर पाई गई या आपके iCloud खातों से जुड़ी व्यक्तिगत जानकारी शामिल हो सकती हैं। इस जानकारी का उपयोग Apple द्वारा इसकी गोपनीयता नीति (www.apple.com/in/privacy) के अनुरूप किया जाएगा और इसे किसी अन्य कंपनी के साथ शेयर नहीं किया जाएगा। इस टूल का उपयोग कर और परिणामों को Apple को भेजकर आप Apple उत्पादों को बेहतर बनाने के लिए इन फ़ाइलों के कॉन्टेंट को Apple द्वारा उपयोग के लिए अपनी सहमति दे रहे हैं।
hr: Ovaj alat generira datoteke koje Appleu omogućuju istraživanje problema s vašim iPhoneom i pomažu poboljšati Appleove proizvode. Datoteke mogu sadržavati osobne informacije koje se nalaze na vašem uređaju ili su povezane s vašim iCloud računima, uključujući bez ograničenja vaše ime, serijske brojeve vašeg uređaja, naziv vašeg uređaja, vašu e-mail adresu i postavke e‑maila, Siri prijedloge i informacije mrežne veze. Apple koristi te informacije u skladu sa svojim pravilima privatnosti (www.apple.com/legal/privacy/hr/) i ne dijeli ih s drugim tvrtkama. Upotrebom ovog alata i slanjem rezultata Appleu pristajete na to da Apple koristi sadržaj tih datoteka za poboljšanje Appleovih proizvoda.
hu: Ez az eszköz olyan fájlokat hoz létre, amelyek segítségével az Apple meg tudja vizsgálni az iPhone-jával kapcsolatos problémákat, és fejleszteni tudja az Apple-termékeket. A fájlok a készülékén megtalálható vagy iCloud-fiókjaihoz kapcsolódó személyes adatokat tartalmazhatnak, többek között az Ön nevét, a készüléke sorozatszámait, a készülék nevét, az Ön e-mail-címét és e-mail-beállításait, a Siri-javaslatokat és a hálózati kapcsolatra vonatkozó adatokat. Ezeket az adatokat az Apple az adatvédelmi nyilatkozata (www.apple.com/hu/privacy) szerint használja fel, és nem osztja meg őket más vállalatokkal. Amennyiben használja az eszközt, és elküldi az eredményeket az Apple számára, Ön automatikusan engedélyezi az Apple-nek, hogy felhasználja a fájlok tartalmát az Apple-termékek fejlesztésére.
id: Alat ini menghasilkan file yang mengizinkan Apple untuk menginvestigasi masalah dengan iPhone Anda dan membantu meningkatkan produk Apple. File mungkin berisi informasi pribadi yang ditemukan di perangkat Anda atau dikaitkan dengan akun iCloud Anda, termasuk tetapi tidak terbatas pada nama Anda, nomor seri perangkat Anda, nama perangkat Anda, alamat email dan pengaturan email Anda, Saran Siri, dan informasi koneksi jaringan. Informasi ini digunakan Apple sesuai dengan kebijakan privasinya (www.apple.com/id/privacy/) dan tidak dibagikan ke perusahaan lain. Dengan menggunakan alat ini dan mengirim hasil ke Apple, Anda menyetujui Apple menggunakan konten file ini untuk meningkatkan produk Apple.
it: Questo strumento crea file che consentono ad Apple di esaminare i problemi di iPhone e di migliorare i propri prodotti. I file potrebbero contenere informazioni personali presenti sul dispositivo o associate ai tuoi account iCloud, tra cui, a titolo esemplificativo ma non esaustivo, il tuo nome, i numeri di serie e il nome del dispositivo, il tuo indirizzo email e le impostazioni della posta elettronica, i suggerimenti di Siri e informazioni sulla connessione di rete. Queste informazioni verranno utilizzate da Apple in conformità alla propria informativa sulla privacy (www.apple.com/it/privacy) e non verranno condivise con altre aziende. Utilizzando questo strumento e inviando i risultati ad Apple, acconsenti all’utilizzo dei contenuti di tali file per migliorare i propri prodotti.
ja: このツールによりファイルが生成されます。生成ファイルは、Appleによるお使いのiPhoneの問題の調査、およびApple製品の向上に活用されます。生成ファイルには、お名前、お使いのデバイスのシリアル番号、デバイス名、メールアドレスとメール設定、Siriからの提案、ネットワーク接続情報など、デバイス上の個人情報またはiCloudアカウントに関連付けられた個人情報個人情報が含まる場合があります。 これらの情報の利用はAppleのプライバシーポリシー（www.apple.com/privacy）に従って利用され、第三者と共有されることはありません。このツールを使用して結果をAppleに送信することにより、ユーザは これらのファイルをAppleが自社製品の向上に活用することに同意したものとみなされます。
kk: Бұл құрал арқылы Apple компаниясына iPhone құрылғыңызбен байланысты мәселелерді тексеруге және Apple өнімдерін жақсартуда көмек көрсетуге мүмкіндік беретін файлдарды жасауға болады. Файлдарда құрылғыңызда табылған немесе iCloud аккаунттарыңызбен байланысты жеке ақпарат, соның ішінде атыңыз, құрылғының сериялық нөмірлері, құрылғы атауы, эл. пошта мекенжайы және эл. пошта реттеулері, Siri ұсыныстары мен желілік қосылым туралы ақпарат бар болуы мүмкін. Apple компаниясы бұл ақпаратты құпиялылық саясатына сәйкес (www.apple.com/privacy) пайдаланады және оны қандай да бір басқа компаниямен бөліспейді. Осы құралды пайдаланып, нәтижелерін Apple компаниясына жіберу арқылы Apple компаниясының осы файлдарды өз өнімдерін жақсарту үшін пайдалануына келісіміңізді бересіз.
ko: 이 도구는 Apple이 사용자 iPhone의 문제를 조사하고 자사의 제품을 개선하는데 도움이 되는 파일을 생성합니다. 이 파일에는 사용자의 이름, 기기 일련 번호, 기기 이름, 이메일 주소 및 이메일 설정, Siri 제안 및 네트워크 연결 정보(이에 제한되지 않음) 등 사용자 기기에 있거나 iCloud 계정과 관련된 개인정보가 포함될 수 있습니다. 이 정보는 개인정보 처리방침(www.apple.com/kr/privacy)에 따라 Apple에서 사용하며 타사와 공유하지 않습니다. 이 도구를 사용하여 결과를 Apple에 보내면 Apple이 자사의 제품을 개선하기 위해 해당 파일의 콘텐츠를 사용하는 데 동의하는 것입니다.
lt: Šis įrankis generuoja failus, kurie padeda „Apple“ nagrinėti problemas naudojant „iPhone“ ir tobulinti „Apple“ produktus. Failuose gali būti asmeninės informacijos, kurią galima rasti jūsų įrenginyje arba kuri yra susieta su jūsų „iCloud“ paskyromis, įskaitant, bet neapsiribojant vardu ir pavarde, įrenginio serijos numeriu, įrenginio pavadinimu, jūsų el. pašto adresu ir el. pašto nustatymais, „Siri“ pasiūlymais ir tinklo ryšio informacija. Šią informaciją bendrovė „Apple“ naudoja remdamasi privatumo politika (www.apple.com/lt/privacy) ir jos nesidalija su jokia kita įmone. Naudodami šį įrankį ir siųsdami rezultatus „Apple“, sutinkate, kad „ Apple“ naudotų šių failų turinį „Apple“ produktams tobulinti.
ms: Alat ini menjana fail yang membenarkan Apple menyiasat isu dengan iPhone anda dan membantu mempertingkat produk Apple. Fail tersebut mungkin mengandungi maklumat peribadi yang ditemui pada peranti anda atau dikaitkan dengan akaun iCloud anda, termasuk tetapi tidak terhad kepada nama anda, nombor siri peranti anda, nama peranti anda, alamat e‑mel dan seting e‑mel anda, cadangan Siri dan maklumat sambungan rangkaian. Maklumat ini digunakan oleh Apple selaras dengan dasar privasinya (www.apple.com/my/privacy) dan tidak dikongsi dengan sebarang syarikat lain. Dengan menggunakan alat ini dan menghantar keputusan kepada Apple, anda bersetuju dengan Apple menggunakan kandungan fail ini untuk mempertingkat produk Apple.
nl: Dit hulpprogramma maakt bestanden aan die Apple gebruikt om problemen met je iPhone te onderzoeken en om Apple producten verder te verbeteren. De bestanden bevatten mogelijk persoonlijke gegevens die afkomstig zijn van je apparaat of verband houden met je iCloud-accounts, inclusief maar niet beperkt tot je naam, de serienummers en naam van je apparaat, je e‑mailadres en e‑mailinstellingen, Siri-suggesties en informatie over netwerkverbindingen. Deze gegevens worden door Apple gebruikt in overeenstemming met het privacybeleid van Apple (www.apple.com/nl/privacy) en worden niet met andere bedrijven gedeeld. Door dit hulpprogramma te gebruiken en de resultaten naar Apple te versturen, stem je ermee in dat Apple de inhoud van deze bestanden gebruikt voor de verbetering van Apple producten.
no: Dette verktøyet oppretter filer som Apple kan bruke for å undersøke feil på iPhone og forbedre Apple-produkter. Filene kan inneholde personlig informasjon som befinner seg på enheten, eller som er knyttet til iCloud-kontoene dine, inkludert, men ikke begrenset til, navnet ditt, navnet og serienummeret til enheten, e‑postadressen og e‑postinnstillingene dine, Siri-forslag og informasjon om nettverksforbindelsen. Informasjonen brukes av Apple i henhold til Apples retningslinjer for personvern (www.apple.com/no/privacy) og deles ikke med andre selskaper. Ved å ta i bruk verktøyet og sende resultatet til Apple tillater du at Apple bruker innholdet i filene for å forbedre Apple-produkter.
pl: To narzędzie generuje pliki pozwalające Apple badać problemy z iPhone’em i ulepszać produkty Apple. Pliki mogą zawierać dane osobowe znalezione na Twoim urządzeniu lub powiązane z Twoimi kontami iCloud, w tym Twoje imię i nazwisko, numery seryjne urządzenia, nazwę użytkownika, adres i ustawienia email, sugestie Siri oraz dane połączeń sieciowych. Informacje te są wykorzystywane przez Apple zgodnie z zasadami zachowania prywatności (www.apple.com/pl/privacy) i nie są udostępniane innym firmom. Używając tego narzędzia i wysyłając wyniki do Apple, wyrażasz zgodę na wykorzystywanie zawartości tych plików przez Apple w celu ulepszania produktów Apple.
pt_br: Esta ferramenta gera arquivos que permitem à Apple investigar problemas com o seu iPhone e ajudam a melhorar os produtos da Apple. Os arquivos podem conter informações pessoais do seu dispositivo ou associadas às suas contas do iCloud, incluindo mas não se limitando a: seu nome, números de série do dispositivo, o nome do dispositivo, seu endereço e ajustes de e-mail, sugestões da Siri e informações de conexão de rede. Essas informações são usadas pela Apple de acordo com sua política de privacidade (www.apple.com/br/privacy) e não são compartilhadas com nenhuma outra empresa. Ao usar esta ferramenta e enviar os resultados à Apple, você consente que a Apple use o conteúdo desses arquivos para melhorar os produtos da Apple.
pt_pt: Esta ferramenta gera ficheiros que permitem à Apple investigar problemas com o seu iPhone e melhorar os respetivos produtos. Os ficheiros podem conter informação pessoal guardada no seu dispositivo ou associada às suas contas iCloud, incluindo o seu nome, números de série, o nome do dispositivo, o seu endereço de e‑mail e definições de e‑mail, sugestões de Siri e informação sobre a ligação de rede. Esta informação é usada pela Apple em conformidade com a respetiva política de privacidade (www.apple.com/pt/privacy) e não é partilhada com nenhuma outra empresa. Ao usar esta ferramenta e ao enviar os resultados à Apple, aceita que a Apple use essa informação para melhorar os respetivos produtos.
ro: Acest instrument generează fișiere care permit ca Apple să investigheze problemele iPhone‑ului dvs. și să ajute la îmbunătățirea produselor Apple. Fișierele pot conține informații personale aflate pe dispozitivul dvs. sau asociate cu conturile dvs. de iCloud, inclusiv, dar fără a se limita la, numele dvs., numerele seriale ale dispozitivului, numele dispozitivului, adresa și configurările dvs. de e‑mail, sugestiile Siri și informații despre conexiunea la rețea. Aceste informații sunt utilizate de Apple în conformitate cu politica sa de confidențialitate (www.apple.com/ro/privacy) și nu sunt puse la dispoziția niciunei alte companii. Prin utilizarea acestui instrument și trimiterea rezultatelor la Apple, sunteți de acord ca Apple să utilizeze conținutul acestor fișiere pentru a îmbunătăți produsele Apple.
ru: Этот инструмент генерирует файлы, которые позволяют Apple изучать проблемы с Вашим iPhone и помогают улучшать продукты компании. Файлы могут содержать персональную информацию, хранящуюся на Вашем устройстве или связанную с Вашей учетной записью iCloud, в том числе Ваше имя, серийный номер и имя устройства, адрес и настройки электронной почты, предложения Siri, а также информацию об интернет-подключении. Apple использует эту информацию в соответствии со своей политикой конфиденциальности (www.apple.com/ru/privacy) и не передает ее другим компаниям. Используя этот инструмент и отправляя данные в Apple, Вы соглашаетесь с тем, что компания Apple будет использовать содержимое файлов диагностики для улучшения своих продуктов.
sk: Tento nástroj vytvára súbory, ktoré umožňujú spoločnosti Apple preskúmať problémy s vaším iPhonom a vylepšovať jej produkty. Súbory môžu obsahovať osobné informácie nájdené na vašom zariadení alebo súvisiace s vašimi iCloud účtami, napríklad vaše meno, sériové čísla vášho zariadenia, názov vášho zariadenia, vašu emailovú adresu a nastavenia emailu, návrhy Siri a informácie o sieťovom pripojení. Tieto informácie budú použité spoločnosťou Apple v súlade s jej zásadami ochrany osobných údajov (www.apple.com/sk/privacy) a nebudú zdieľané so žiadnou inou spoločnosťou. Používaním tohto nástroja a odoslaním výsledkov do Apple súhlasíte s využitím obsahu týchto súborov na vylepšovanie produktov spoločnosti Apple.
sl: To orodje ustvari datoteke, ki družbi Apple omogočajo preiskovanje težav z iPhonom in pomagajo izboljšati izdelke Apple. Datoteke lahko vključujejo osebne podatke, najdene v vaši napravi ali povezane z vašimi računi iCloud, kar med drugim vključuje vaše ime, serijske številke vaše naprave, ime vaše naprave, vaš e-poštni naslov in nastavitve za e-pošto, Sirijine predloge ter podatke o omrežni povezavi. Apple te podatke uporablja skladno s svojim pravilnikom o zasebnosti (www.apple.com/privacy) in jih ne deli z nobenim drugim podjetjem. Z uporabo tega orodja in pošiljanjem rezultatov družbi Apple soglašate, da družba Apple uporablja vsebine teh datotek za izboljšanje izdelkov Apple.
sv: Det här verktyget genererar filer som gör det möjligt för Apple att undersöka problem med iPhone och hjälper till att förbättra Apples produkter. Filerna kan innehålla personlig information som hittas på din enhet eller är associerad med ditt eller dina iCloud-konton, inklusive men inte begränsat till ditt namn, serienummer och namn på din enhet, din e-postadress och e-postinställningar, Siri-förslag och information om nätverksanslutningen. Denna information används i enlighet med Apples integritetspolicy (www.apple.com/se/privacy) och delas inte med något annat företag. Genom att använda detta verktyg och skicka resultaten till Apple samtycker du till att Apple använder innehållet i filerna till att förbättra Apples produkter.
th: เครื่องมือนี้จะสร้างไฟล์ที่ทำให้ Apple สามารถตรวจสอบปัญหาที่เกิดกับ iPhone ของคุณและช่วยปรับปรุงผลิตภัณฑ์ของ Apple ได้ ไฟล์เหล่านี้อาจมีข้อมูลส่วนบุคคลที่พบในอุปกรณ์ของคุณหรือเชื่อมโยงกับบัญชี iCloud ของคุณ ซึ่งรวมถึงแต่ไม่จำกัดเพียง ชื่อของคุณ เลขประจำเครื่องของอุปกรณ์ของคุณ ชื่ออุปกรณ์ของคุณ ที่อยู่อีเมลและการตั้งค่าอีเมลของคุณ คำแนะนำโดย Siri และข้อมูลการเชื่อมต่อเครือข่าย Apple จะใช้ข้อมูลนี้ตามนโยบายความเป็นส่วนตัวของบริษัท (www.apple.com/th/privacy) และจะไม่แชร์ข้อมูลนี้ให้กับบริษัทอื่นใด โดยการใช้เครื่องมือนี้และส่งผลลัพธ์ให้กับ Apple จะถือว่า คุณยินยอมให้ Apple ใช้เนื้อหาของไฟล์เหล่านี้เพื่อปรับปรุงผลิตภัณฑ์ของ Apple ได้
tr: Bu araç Apple’ın iPhone’unuzla ilgili sorunları araştırmasını sağlayan ve Apple ürünlerini iyileştirmesine yardımcı olan dosyalar oluşturur. Dosyalar; adınız, aygıtınızın seri numaraları, aygıtınızın adı, e-posta adresiniz ve e-posta ayarlarınız, Siri önerileri ve ağ bağlantı bilgileri de dahil ama bunlarla sınırlı olmamak üzere aygıtınızda bulunan veya iCloud hesaplarınızla ilişkili kişisel bilgiler içerebilir. Bu bilgiler, Apple tarafından gizlilik politikasına (www.apple.com/tr/privacy) uygun şekilde kullanılır ve başka hiçbir şirketle paylaşılmaz. Bu aracı kullanarak ve sonuçları Apple’a göndererek bu dosyaların içeriklerini Apple ürünlerini iyileştirmek amacıyla kullanma iznini Apple’a vermiş olursunuz.
uk: Цей засіб створює файли, які дають змогу Apple досліджувати проблеми з вашим iPhone і покращувати продукти Apple. Ці файли можуть містити особисту інформацію, виявлену на вашому пристрої або повʼязану з вашими обліковими записами iCloud, зокрема, але не тільки: ваше імʼя та прізвище, серійні номери ваших пристроїв, назви пристроїв, адресу та параметри е‑пошти, пропозиції Siri та інформацію про підʼєднання до мережі. Ця інформація використовується компанією Apple згідно з політикою конфіденційності (www.apple.com/ua/privacy) і не надається стороннім компаніям. Почавши використання цього засобу й надіславши результати в Apple, ви надаєте Apple згоду на використання вмісту цих файлів для покращення продукції Apple.
vi: Công cụ này tạo ra các tệp cho phép Apple điều tra các sự cố với iPhone của bạn và giúp cải thiện các sản phẩm của Apple. Những tệp này có thể chứa thông tin cá nhân được tìm thấy trên thiết bị của bạn hoặc được liên kết với các tài khoản iCloud của bạn, bao gồm nhưng không giới hạn đến tên của bạn, số sê-ri của thiết bị, tên thiết bị của bạn, địa chỉ email và cài đặt email của bạn, gợi ý của Siri và thông tin kết nối mạng. Thông tin này được Apple sử dụng tuân theo chính sách về quyền riêng tư của hãng (www.apple.com/vn/privacy) và không được chia sẻ với bất kỳ công ty nào khác. Bằng việc sử dụng công cụ này và gửi kết quả đến Apple, bạn chấp thuận để Apple sử dụng nội dung của những tệp này nhằm cải thiện các sản phẩm của Apple.
zh_cn: 此工具会生成文件以允许Apple检查你iPhone的问题并帮助改进Apple产品。文件可能包含设备上或与iCloud账户相关联的个人信息，包括但不限于你的姓名、设备序列号、设备名称、电子邮件地址和设置、Siri建议和网络连接信息。 Apple会根据其隐私政策(www.apple.com/cn/privacy)使用此信息，并且不会与任何其他公司共享。使用此工具并将结果发送给Apple，即表明你同意Apple使用这些文件的内容来改进Apple产品。
zh_hk: 此工具所產生的檔案會允許Apple檢查你的iPhone問題，並協助改進Apple的產品。檔案中可能包括在你的裝置上找到或與你iCloud帳户相關的個人資料，可能包括但不限於你的姓名、裝置的序號、裝置的名稱、用户名稱、電郵地址和電郵設定、Siri建議項目和網絡連線的資料。 Apple將會根據其私隱政策（www.apple.com/hk/privacy）使用這些資料，並且不會與任何其他公司分享。使用此工具並將其結果傳送給Apple，即表示你同意Apple使用上述檔案的內容以改善Apple產品。
zh_tw: 此工具所產生的檔案會允許Apple檢查你的iPhone問題，並協助改進Apple的產品。檔案中可能包含在你裝置上找到或與你iCloud帳號相關的個人資訊，包含但不限於你的姓名、裝置的序號、裝置的名稱、你的電子郵件地址和電子郵件設定、Siri建議和網路連線的資訊。 Apple會遵守本公司的隱私權政策（www.apple.com/tw/privacy）來使用這些資訊，並且不會與任何其他公司分享這些資訊。使用此工具並傳送結果給Apple即表示你同意Apple使用這些檔案的內容來協助改進Apple的產品。
